Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПромаркированаДляЦелейМДЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СерииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Владелец)
	Тогда
		Объект.СерияПромаркированаДляЦелейМДЛП = РассчитатьНаличиеМаркировкиПоУмолчанию(Объект.Владелец);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерСерииПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГоденДоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры 

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Владелец)
	Тогда
		Объект.СерияПромаркированаДляЦелейМДЛП = РассчитатьНаличиеМаркировкиПоУмолчанию(Объект.Владелец);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	ШаблонСтроки = НСтр("ru='%1%2%3'");
	Объект.Наименование = СтрШаблон(ШаблонСтроки, Объект.НомерСерии,
		?(ЗначениеЗаполнено(Объект.НомерСерии) И ЗначениеЗаполнено(Объект.ГоденДо), " ", ""), 
		?(ЗначениеЗаполнено(Объект.ГоденДо), "(годен до " + Формат(Объект.ГоденДо, "ДЛФ=D") + ")", "")); 
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция РассчитатьНаличиеМаркировкиПоУмолчанию(Номенклатура)
	
	Возврат ЗначениеЗаполнено(Номенклатура.ВидМаркированнойПродукции);
	
КонецФункции

#КонецОбласти
